[
    {
        "title": "Trump-appointed judge halts Biden administration credit card late fee cap - The Hill",
        "category": "business",
        "content": "Skip to content\r\nA former President Trump-appointed judge in Texas halted President Biden’s administration’s plan to decrease late fees on credit cards to $8. \r\nThe new rule, which was set to take pl… [+1405 chars]",
        "url": "https://thehill.com/business/4658227-trump-appointed-judge-halts-biden-administration-credit-card-late-fee-cap/"
    },
    {
        "title": "Red, yellow, green ... and white? Smarter vehicles could mean big changes for the traffic light - The Associated Press",
        "category": "business",
        "content": "As cars and trucks get smarter and more connected, the humble lights that have controlled the flow of traffic for more than a century could also be on the cusp of a major transformation.\r\nResearchers… [+4809 chars]",
        "url": "https://apnews.com/article/smarter-traffic-signals-north-carolina-michigan-757d6151e85565e9656d7b95c6e72490"
    },
    {
        "title": "Winner winner: Virginia man goes out for chicken, wins $500,000 - Fox Business",
        "category": "business",
        "content": "Winner, winner, chicken dinner – literally.\r\nA Virginia man recently went to the grocery store to pick up some chicken – and came back half a million dollars richer.\r\nRussell Gomes, of South Boston, … [+2612 chars]",
        "url": "https://www.foxbusiness.com/lifestyle/winner-winner-virginia-man-goes-chicken-wins-500000"
    },
    {
        "title": "Fast food is expensive. Applebee's and Chili's are moving in - KABC-TV",
        "category": "business",
        "content": "McDonald's and other fast food chains are charging more. So much so that you may want to consider going for a slightly slower burger. Or at least, that's what Applebee's wants you to think about.\r\n\"Y… [+5502 chars]",
        "url": "https://abc7.com/post/fast-food-is-expensive-applebees-and-chilis-are-moving-in/14799507/"
    },
    {
        "title": "Mark Cuban: 'Crypto voters will be heard this election' - Here's why - AMBCrypto News",
        "category": "business",
        "content": "<ul><li>SEC-crypto clashes affect election dynamics, industry growth, and voter sentiments.</li><li>Trump’s and Biden’s crypto stances shift support among voters, revealing a political divide.</li></… [+1947 chars]",
        "url": "https://ambcrypto.com/mark-cuban-crypto-voters-will-be-heard-this-election-heres-why/"
    },
    {
        "title": "Billionaire Ken Griffin calls rebukes Harvard during war protests - The Jerusalem Post",
        "category": "business",
        "content": "Billionaire investor Kenneth Griffin called on his alma mater, Harvard University, on Saturday to embrace \"Western values,\" saying that the turmoil across college campuses was the product of a \"cultu… [+2162 chars]",
        "url": "https://www.jpost.com/diaspora/article-800794"
    },
    {
        "title": "[Removed]",
        "category": "business",
        "content": "[Removed]",
        "url": "https://removed.com"
    },
    {
        "title": "Berlin Tesla activists say civil disobedience is only option - DW (English)",
        "category": "business",
        "content": "Activists holding a press conference\r\nover the expansion of Tesla's electric car factory on Saturday complained of betrayal by regional politicians and said civil disobedience was necessary.\r\nAt leas… [+3034 chars]",
        "url": "https://www.dw.com/en/berlin-tesla-activists-say-civil-disobedience-is-only-option/a-69054007"
    },
    {
        "title": "Meet the doomsayers waiting for the economy to crash - Business Insider",
        "category": "business",
        "content": "Daniel, a Reddit user based in Washington, DC, has been browsing the subreddit r/economiccollapse for about four years. He says he isn't a doomsayer, but he sees an economic implosion coming for the … [+6033 chars]",
        "url": "https://www.businessinsider.com/economy-stock-market-crash-inflation-debt-jobs-economic-collapse-reddit-2024-5"
    },
    {
        "title": "America's love affair with the SUV is killing the trusty sedan - Yahoo Finance",
        "category": "business",
        "content": "The Chevy Malibu has gone the way of the dodo.\r\nThe long-running Malibu nameplate has had two separate runs with Chevrolet, with its first stint dating back 50 years. GM sold 10 million Malibus durin… [+5429 chars]",
        "url": "https://finance.yahoo.com/news/americas-love-affair-with-the-suv-is-killing-the-trusty-sedan-150138154.html"
    },
    {
        "title": "Tesla’s profitable Supercharger network is in limbo after Musk axed the entire team - TechCrunch",
        "category": "business",
        "content": "At the start of the year, Teslas Supercharger team was tasked with the impossible. We were on an exponential path, a former team member told TechCrunch, adding that the new targets were super-duper c… [+7807 chars]",
        "url": "https://techcrunch.com/2024/05/11/teslas-profitable-supercharger-network-in-limbo-after-musk-axed-entire-team/"
    },
    {
        "title": "Huge solar storm impacting Starlink satellites, 'degraded service' reported: Musk - Fox Business",
        "category": "business",
        "content": "Elon Musk has said that the powerful geomagnetic storm hitting Earth right now is putting Starlink satellites under tremendous strain.\r\nConditions reached level 5 on the 5-point scale of geomagnetic … [+3852 chars]",
        "url": "https://www.foxbusiness.com/technology/huge-solar-storm-impacting-starlink-satellites-degraded-service-reported-musk"
    },
    {
        "title": "Biden's coming new tariffs on China reflect 'lessons learned' - Yahoo Finance",
        "category": "business",
        "content": "A sweeping White House action to raise tariffs on China as early as next week \"reflects lessons learned\" about the behavior of the country, according to a former official who helped lead the governme… [+6143 chars]",
        "url": "https://finance.yahoo.com/news/bidens-coming-new-tariffs-on-china-reflect-lessons-learned-130114807.html"
    },
    {
        "title": "Newsom’s latest insurance move could help Californians avoid canceled policies — but they’ll have to pay - The Mercury News",
        "category": "business",
        "content": "As some Californians continue scrambling for ways to affordably insure their homes, Gov. Gavin Newsom on Friday announced a push to expedite how quickly insurance companies can increase rates.\r\nSpeed… [+3230 chars]",
        "url": "https://www.mercurynews.com/2024/05/11/newsoms-latest-insurance-move-could-help-californians-avoid-cancelled-policies-but-theyll-have-to-pay/"
    },
    {
        "title": "Bumble Founder Says Future of Dating Is Your AI Will Date Other People's AIs and Hook You Up With the Best Matches - Futurism",
        "category": "business",
        "content": "The founder of the dating app Bumble Whitney Wolfe Herd believes the future of dating will involve having your personal AI \"dating concierge\" talk to hundreds of other AIs to find a match.\r\nThat unab… [+3463 chars]",
        "url": "https://futurism.com/bumble-founder-future-ai-dating-other-ais"
    },
    {
        "title": "From Burger King to Panda Express, 7 places you can get Mother’s Day freebies and discounts this weekend - CNBC",
        "category": "business",
        "content": "Mother's Day is right around the corner, and restaurants across the U.S. are offering up freebies and discounts to help you celebrate.\r\nThis year, Mother's Day falls on Sunday, May 12. Whether you're… [+2212 chars]",
        "url": "https://www.cnbc.com/2024/05/11/mothers-day-food-freebies-discounts-and-deals.html"
    },
    {
        "title": "A record 4.1 million Americans may retire this year: Financial planners say they should take these 5 steps - Yahoo Finance",
        "category": "business",
        "content": "The so-called silver tsunami of retirees is beginning to crest this year, as a record-high 4.1 million Americans turn 65 in 2024. While many are part of an exodus from the workforce, not all of them … [+7744 chars]",
        "url": "https://finance.yahoo.com/news/record-4-1-million-americans-120000058.html"
    },
    {
        "title": "Wall Street Is Sending a Bullish Signal for S&P 500 Earnings - Bloomberg",
        "category": "business",
        "content": "Analysts are ratcheting up earnings forecasts for the current quarter at the swiftest pace in two years, suggesting that the worst of Corporate Americas profit slump may be firmly in the rear-view mi… [+245 chars]",
        "url": "https://www.bloomberg.com/news/articles/2024-05-11/wall-street-is-sending-a-bullish-signal-for-s-p-500-earnings"
    },
    {
        "title": "Buffett Is Selling Apple Stock. The Reason Why Is Eye-Opening. - The Motley Fool",
        "category": "business",
        "content": "Apple has been Berkshire's top stock for nearly a decade.Warren Buffett and his team at Berkshire Hathaway (BRK.A 1.00%)(BRK.B 0.79%) have been nearly synonymous with Apple (AAPL -0.69%) since taking… [+3334 chars]",
        "url": "https://www.fool.com/investing/2024/05/11/why-buffett-is-selling-apple-stock/"
    },
    {
        "title": "3 Austin barbecue restaurants make Yelp's Top 100 BBQ spots in the US - Austin American-Statesman",
        "category": "business",
        "content": "Austin is home to iconic barbecue chains such as Franklin Barbecue and The Salt Lick, but a new list of top barbecue restaurants is showing some love to other local spots.\r\nThe list of top 100 barbec… [+1275 chars]",
        "url": "https://www.statesman.com/story/entertainment/dining/2024/05/11/austin-yelp-top-100-best-barbecue-list-2024-millers-smokehouse-browns-bbq-micklethwait-craft-meats/73643670007/"
    },
    {
        "title": "‘Kingdom Of The Planet Of The Apes’ Evolving Towards $125M+ Global Debut – International Box Office - Deadline",
        "category": "entertainment",
        "content": "EXCLUSIVE:20th Century Studios/Disney’s Kingdom of the Planet of the Apes is beating its chest towards a $125M global bow this weekend. At the international box office, we understand the Wes Ball-dir… [+1542 chars]",
        "url": "http://deadline.com/2024/05/kingdom-of-the-planet-of-the-apes-fall-guy-if-global-international-box-office-1235912415/"
    },
    {
        "title": "[Removed]",
        "category": "entertainment",
        "content": "[Removed]",
        "url": "https://removed.com"
    },
    {
        "title": "Eurovision disqualifies Dutch act Joost Klein over incident involving female crew member - CNN",
        "category": "entertainment",
        "content": "The Eurovision Song Contest was thrown into fresh turmoil Saturday when organizers disqualified the Dutch entrant hours before the grand final for a backstage incident involving a female crew member.… [+4918 chars]",
        "url": "https://www.cnn.com/2024/05/11/entertainment/eurovision-disqualifies-dutch-entrant-joost-klein-intl/index.html"
    },
    {
        "title": "Prince Harry plays sit-down volleyball on Nigeria visit with Meghan - BBC.com",
        "category": "entertainment",
        "content": null,
        "url": "https://www.bbc.com/news/world-africa-68995686"
    },
    {
        "title": "Live Stream Eurovision Grand Final From Anywhere: Where to Watch Free - Business Insider",
        "category": "entertainment",
        "content": "When you buy through our links, Business Insider may earn an affiliate commission. Learn more\r\nThe 2024 Eurovision Song Contest comes to a close today with the Grand Final, which will see 26 countrie… [+4605 chars]",
        "url": "https://www.businessinsider.com/guides/streaming/live-stream-eurovision-song-contest-grand-final-2024"
    },
    {
        "title": "Prince Harry 'in tears' after King Charles bestows military honor on Prince William: 'The gloves are off' - New York Post ",
        "category": "entertainment",
        "content": "Prince Harry was reduced to tears after learning King Charles had bestowed a new honor upon Prince William, a royal expert claims. \r\nOn Tuesday, Buckingham Palace announced that William, 41, will be … [+3049 chars]",
        "url": "https://nypost.com/2024/05/11/entertainment/prince-harry-in-tears-after-king-charles-bestows-military-honor-on-prince-william-the-gloves-are-off/"
    },
    {
        "title": "Israel's Eurovision Contestant Jeered and Cheered at Grand Final; Thousands Protest in Malmö - Israel News - Haaretz",
        "category": "entertainment",
        "content": "Thousands of people marched through Malmö to protest Israeli singer Eden Golan's participation and to demand a Gaza cease-fire; Police removes dozens protesting outside of the arena; In Finland, doze… [+141 chars]",
        "url": "https://www.haaretz.com/israel-news/2024-05-11/ty-article/.premium/eurovision-reaches-its-grand-final-as-gaza-war-tensions-steal-the-spotlight/0000018f-683a-de93-a1af-7c3afe010000"
    },
    {
        "title": "Joanna Newsom Pays Tribute To Steve Albini At Kilby Block Party: Watch - Stereogum",
        "category": "entertainment",
        "content": "In a surprise opening set for Fleet Foxes last year, which was her first show in over three years, Joanna Newsom debuted six new songs. Last nights performance at Kilby Block Party was her first conc… [+1670 chars]",
        "url": "https://www.stereogum.com/2263197/watch-joanna-newsom-pay-tribute-to-steve-albini-at-kilby-block-party/news/"
    },
    {
        "title": "[Removed]",
        "category": "entertainment",
        "content": "[Removed]",
        "url": "https://removed.com"
    },
    {
        "title": "The Disney and Warner Bros Streaming Partnership Spells Trouble For Curation on Disney Plus, Hulu and Max - IGN",
        "category": "entertainment",
        "content": "Streaming Wars is a weekly opinion column\r\n by IGNs Streaming Editor, Amelia Emberwing. To read the last entry, check out Its Time For You To Watch Interview with the Vampire\r\n. \r\nRecently, Disney an… [+4601 chars]",
        "url": "https://www.ign.com/articles/the-disney-and-warner-bros-streaming-partnership-spells-trouble-for-curation-on-disney-plus-hulu-and-max"
    },
    {
        "title": "[Removed]",
        "category": "entertainment",
        "content": "[Removed]",
        "url": "https://removed.com"
    },
    {
        "title": "Shock Miss USA resignations are just the tip of the iceberg, insiders say - CNN",
        "category": "entertainment",
        "content": "During their year of service, pageant queens are highly visible, making appearances at major events, advocating for important causes and speaking at public engagements, all in an official capacity. B… [+9278 chars]",
        "url": "https://www.cnn.com/2024/05/11/style/miss-usa-pageant-organization-allegations/index.html"
    },
    {
        "title": "Taylor Swift Wows Paris Fans On Night Two With Change To Setlist And A Brand New Mash-Up - Deadline",
        "category": "entertainment",
        "content": "Taylor Swift now has more than 30 songs to choose from for her concerts, so she’s keeping herself interested – and fans on the edge of their seats – with a few changes to the setlist for her record-b… [+994 chars]",
        "url": "http://deadline.com/2024/05/taylor-swift-eras-tour-tortured-poets-department-out-of-the-woods-mash-up-1235912368/"
    },
    {
        "title": "Sean \"Diddy\" Combs asks judge to dismiss sexual assault lawsuit - CBS News",
        "category": "entertainment",
        "content": "Sean \"Diddy\" Combs on Friday asked a federal judge to dismiss a lawsuit alleging that he and two co-defendants raped a 17-year-old girl in a New York recording studio in 2003, saying it was a \"false … [+4706 chars]",
        "url": "https://www.cbsnews.com/news/sean-diddy-combs-judge-dismiss-false-claim-raped-17-year-old-girl/"
    },
    {
        "title": "1 dead after shooting inside Regal Cinemas theater in Ohio - ABC News",
        "category": "entertainment",
        "content": "A late night shooting inside an Ohio movie theater has left one man dead, police said.\r\nThe shooting took place at approximately 11 p.m. when the Massilon Police Department were notified of a shootin… [+704 chars]",
        "url": "https://abcnews.go.com/US/1-dead-after-shooting-inside-regal-cinemas-theater/story?id=110130115"
    },
    {
        "title": "After ‘Fall Guy’ flop, Hollywood braces for uncertain summer - The Hill",
        "category": "entertainment",
        "content": "Skip to content\r\nA year after the “Barbenheimer” cultural frenzy that raked in hundreds of millions for Hollywood, the movie-making business is entering summer with no clear blockbuster on the horizo… [+5465 chars]",
        "url": "https://thehill.com/homenews/media/4657039-hollywood-summer-box-office/"
    },
    {
        "title": "Tom Brady's roast burns Kim Kardashian, Ben Affleck in aftermath of brutal Netflix special - Fox News",
        "category": "entertainment",
        "content": "Join Fox News for access to this content\r\nPlus special access to select articles and other premium content with your account - free of charge.\r\nPlease enter a valid email address.\r\nBy entering your e… [+5576 chars]",
        "url": "https://www.foxnews.com/entertainment/tom-bradys-roast-burns-kim-kardashian-ben-affleck-aftermath-brutal-netflix-special"
    },
    {
        "title": "Ireland’s Eurovision contestant ‘cried’ over Israel going to grand final - The Jerusalem Post",
        "category": "entertainment",
        "content": "Bambie Thug, Ireland’s Eurovision competitor for 2024, announced during an interview that they had cried upon learning that Israel’s Eden Golan had made it through to the grand final, according to mu… [+1657 chars]",
        "url": "https://www.jpost.com/international/article-800768"
    },
    {
        "title": "CREED's SCOTT STAPP And Wife Divorcing After 18 Years Of Marriage - BLABBERMOUTH.NET",
        "category": "entertainment",
        "content": null,
        "url": "https://blabbermouth.net/news/creeds-scott-stapp-and-wife-divorcing-after-18-years-of-marriage"
    },
    {
        "title": "Horoscope for Saturday, May 11, 2024 - Chicago Sun-Times",
        "category": "entertainment",
        "content": "Moon Alert\r\nThere are no restrictions to shopping or important decisions. The moon is in Cancer.\r\nAries (March 21-April 19)\r\nTread carefully when dealing with family members because people are touchy… [+3945 chars]",
        "url": "https://chicago.suntimes.com/horoscopes/2024/05/11/horoscopes-today-saturday-may-11-2024"
    },
    {
        "title": "Devastation in Gaza as Israel wages war on Hamas: Live updates - CNN",
        "category": "general",
        "content": "The Al Qassam Brigades, the military wing of Hamas, claimed that one of the Israeli hostages held in Gaza died more than a month ago. \r\nAbu Obaida, the military wing's spokesperson, said on Telegram … [+1045 chars]",
        "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-05-11-24/index.html"
    },
    {
        "title": "Solar storm puts on brilliant light show across the globe, but no serious problems reported - The Associated Press",
        "category": "general",
        "content": "A powerful solar storm put on an amazing skyward light show across the globe overnight but has caused what appeared to be only minor disruptions to the electric power grid, communications and satelli… [+3913 chars]",
        "url": "https://apnews.com/article/solar-storm-northern-lights-power-grid-disruption-eb7fabd1dfbd734a398192bf4c701ca5"
    },
    {
        "title": "Eden Golan gives a flawless performance in Eurovision final despite boos - The Jerusalem Post",
        "category": "general",
        "content": "Eden Golan gave a flawless performance of the song \"Hurricane\" in the Eurovision final in Malmo, Sweden on Saturday night, as some in the crowd booed her, while others cheered.\r\nThe song references t… [+2193 chars]",
        "url": "https://www.jpost.com/international/article-800825"
    },
    {
        "title": "Oklahoma City Thunder @ Dallas Mavericks | #NBAPlayoffs presented by Google Pixel Live Scoreboard - NBA",
        "category": "general",
        "content": null,
        "url": "https://www.youtube.com/watch?v=R3h-YVB7KQ4"
    },
    {
        "title": "Trump-appointed judge halts Biden administration credit card late fee cap - The Hill",
        "category": "general",
        "content": "Skip to content\r\nA former President Trump-appointed judge in Texas halted President Biden’s administration’s plan to decrease late fees on credit cards to $8. \r\nThe new rule, which was set to take pl… [+1405 chars]",
        "url": "https://thehill.com/business/4658227-trump-appointed-judge-halts-biden-administration-credit-card-late-fee-cap/"
    },
    {
        "title": "Paul Skenes debut best moments and highlights - MLB.com",
        "category": "general",
        "content": null,
        "url": "https://www.mlb.com/news/paul-skenes-debut-best-moments-and-highlights"
    },
    {
        "title": "Ukraine: Hundreds flee Kharkiv area after Russian cross-border attack - BBC.com",
        "category": "general",
        "content": null,
        "url": "https://www.bbc.com/news/world-europe-68994877"
    },
    {
        "title": "Biden's arms embargo on Israel 'emboldens' Hamas missile strikes against Jewish state - Fox News",
        "category": "general",
        "content": "JERUSALEMAfter President Biden gave his ultimatum of withholding offensive weapons to the Jewish state if Israel were to launch an invasion of Rafah, rocket attacks rained down on Israel on Friday fr… [+6335 chars]",
        "url": "https://www.foxnews.com/world/bidens-arms-embargo-israel-emboldens-hamas-missile-strikes-jewish-state"
    },
    {
        "title": "Brad Marchand questionable for G4; Bruins unhappy with hit - ESPN",
        "category": "general",
        "content": "BOSTON -- Brad Marchand is day-to-day with an upper-body injury after a collision with Florida Panthers forward Sam Bennett in Game 3 that the Boston Bruins said might have crossed the line.\r\nThe Bru… [+3034 chars]",
        "url": "https://www.espn.com/nhl/story/_/id/40126082/brad-marchand-questionable-g4-bruins-unhappy-hit"
    },
    {
        "title": "‘Kingdom Of The Planet Of The Apes’ Evolving Towards $125M+ Global Debut – International Box Office - Deadline",
        "category": "general",
        "content": "EXCLUSIVE:20th Century Studios/Disney’s Kingdom of the Planet of the Apes is beating its chest towards a $125M global bow this weekend. At the international box office, we understand the Wes Ball-dir… [+1542 chars]",
        "url": "http://deadline.com/2024/05/kingdom-of-the-planet-of-the-apes-fall-guy-if-global-international-box-office-1235912415/"
    },
    {
        "title": "Donald Trump shuts down rumors about considering Nikki Haley for vice president - CNBC",
        "category": "general",
        "content": "Donald Trump on Saturday made it clear that former Republican presidential candidate Nikki Haley is not on his running mate shortlist, quieting rumors that his campaign had been considering her as an… [+2439 chars]",
        "url": "https://www.cnbc.com/2024/05/11/donald-trump-shuts-down-nikki-haley-vp-rumors.html"
    },
    {
        "title": "Live Stream Eurovision Grand Final From Anywhere: Where to Watch Free - Business Insider",
        "category": "general",
        "content": "When you buy through our links, Business Insider may earn an affiliate commission. Learn more\r\nThe 2024 Eurovision Song Contest comes to a close today with the Grand Final, which will see 26 countrie… [+4605 chars]",
        "url": "https://www.businessinsider.com/guides/streaming/live-stream-eurovision-song-contest-grand-final-2024"
    },
    {
        "title": "Violence at UCLA protest raged for hours before police stepped in - The Washington Post",
        "category": "general",
        "content": "Late on April 30, Sean Tabibian called 911 to say police were needed urgently at the University of California at Los Angeles. All hell had broken loose, Tabibian recalled in an interview. Masked agit… [+16270 chars]",
        "url": "https://www.washingtonpost.com/investigations/2024/05/11/ucla-protests-police-inaction-fights/"
    },
    {
        "title": "Trump heading to Jersey Shore to rally 'mega crowd' in break from hush money trial - ABC News",
        "category": "general",
        "content": "WILDWOOD, N.J. -- After a long week in court, Donald Trump is heading to the Jersey Shore. And he's being greeted by thousands of his friends. \r\nTrump, the presumptive Republican presidential nominee… [+4980 chars]",
        "url": "https://abcnews.go.com/Politics/wireStory/trump-heading-jersey-shore-rally-mega-crowd-weekend-110127648"
    },
    {
        "title": "Suspect arrested in horrific Bronx rape case after video shows woman lassoed from behind on dark street - Fox News",
        "category": "general",
        "content": "Graphic content warning\r\nThe suspect accused of lassoing and raping a woman on a Bronx street in a horrific act caught on video was photographed Saturday after his arrest by the NYPD.\r\nKashaan Parks … [+2098 chars]",
        "url": "https://www.foxnews.com/us/suspect-arrested-horrific-bronx-rape-case-video-shows-woman-lassoed-behind-dark-street"
    },
    {
        "title": "Blinken report says it's impossible to verify Israel broke weapons law in Gaza - Axios",
        "category": "general",
        "content": null,
        "url": "https://www.axios.com/2024/05/10/israel-gaza-weapons-broke-law-blinken"
    },
    {
        "title": "Berlin Tesla activists say civil disobedience is only option - DW (English)",
        "category": "general",
        "content": "Activists holding a press conference\r\nover the expansion of Tesla's electric car factory on Saturday complained of betrayal by regional politicians and said civil disobedience was necessary.\r\nAt leas… [+3034 chars]",
        "url": "https://www.dw.com/en/berlin-tesla-activists-say-civil-disobedience-is-only-option/a-69054007"
    },
    {
        "title": "Afghanistan floods kill at least 153, Taliban interior ministry says - Reuters",
        "category": "general",
        "content": null,
        "url": "https://www.reuters.com/world/asia-pacific/death-toll-afghanistan-floods-rises-151-says-taliban-interior-ministry-2024-05-11/"
    },
    {
        "title": "[Removed]",
        "category": "general",
        "content": "[Removed]",
        "url": "https://removed.com"
    },
    {
        "title": "Airman fatally shot in apartment by police. See the video timeline - CNN",
        "category": "general",
        "content": "A Florida sheriff publicly released bodycam footage from a deputy who fatally shot a Black airman in his home and disputed claims from the victims family that the deputy had gone to the wrong apartme… [+61 chars]",
        "url": "https://www.cnn.com/2024/05/11/us/video/roger-forston-florida-airman-shot-police-bodycam-valencia-pkg-foa-digvid"
    },
    {
        "title": "'I'm a Neurologist, and This Is My Go-To Dinner For Alzheimer's Prevention' - AOL",
        "category": "health",
        "content": "If you click 'Accept all', we and our partners, including 238 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+678 chars]",
        "url": "https://www.aol.com/lifestyle/im-neurologist-dinner-alzheimers-prevention-112500755.html"
    },
    {
        "title": "Inside the Quiet Mind: The Absence of Inner Speech - Neuroscience News",
        "category": "health",
        "content": "Summary: Recent research introduces ‘anendophasia’ as a term for the absence of inner speech, revealing that not everyone experiences internal dialogue. The study compared adults with low and high le… [+4431 chars]",
        "url": "https://neurosciencenews.com/anendophasia-inner-speech-26087/"
    },
    {
        "title": "Mom's Stress Hormone Shapes Child's IQ - Neuroscience News",
        "category": "health",
        "content": "Summary: Elevated cortisol levels during the third trimester of pregnancy are linked to lower IQ scores in 7-year-old boys, but not in girls. In contrast, higher urine cortisone levels during pregnan… [+4164 chars]",
        "url": "https://neurosciencenews.com/cortisol-pregnancy-child-iq-26086/"
    },
    {
        "title": "[Removed]",
        "category": "health",
        "content": "[Removed]",
        "url": "https://removed.com"
    },
    {
        "title": "New findings shed light on why women orgasm more often with female partners - PsyPost",
        "category": "health",
        "content": "A recent study published in Social Psychological and Personality Science sheds light on the orgasm rates of women and how these differ by sexual orientation, revealing that women experience higher ra… [+7508 chars]",
        "url": "https://www.psypost.org/new-findings-shed-light-on-why-women-orgasm-more-often-with-female-partners/"
    },
    {
        "title": "One in Three Everest Climbers Suffers Cardiac Arrhythmia » Explorersweb - ExplorersWeb",
        "category": "health",
        "content": "As the Everest summits begin, climbers must be aware of an extra concern besides the thin air and the effort: their heart condition. Climber and cardiologist Thomas Pilgrim headed a recent study that… [+5998 chars]",
        "url": "https://explorersweb.com/one-in-three-everest-climbers-suffers-cardiac-arrhythmia/"
    },
    {
        "title": "Demon face syndrome: What it's like to have the rare disorder. - Slate",
        "category": "health",
        "content": "In What Its Like, people tell us, well, what its like to have experiences many of us have not even imagined. In this entry, we spoke to Maggie McCart, an administrative assistant at an Illinois unive… [+6396 chars]",
        "url": "https://slate.com/life/2024/05/demon-face-syndrome-what-is-prosopometamorphopsia-rare-disease.html"
    },
    {
        "title": "North Bay animal rescue groups say new federal importation rules for dogs will hamper their work - The Santa Rosa Press Democrat",
        "category": "health",
        "content": "Until about two weeks ago, Odessa Gun was planning to bring two dogs back from China to her rescue farm in Santa Rosa, hoping to give them sanctuary and a better life.\r\nBoth dogs were fully vaccinate… [+4425 chars]",
        "url": "https://www.pressdemocrat.com/article/news/dog-importation-cdc-rules-rescue/"
    },
    {
        "title": "'Surprisingly' high number of adults, even those as young as 20, at risk of heart syndrome - Yahoo! Voices",
        "category": "health",
        "content": "Nearly 90% of adults over age 20 in the United States are at risk of developing heart disease, an alarming new study suggests.\r\nWhile the unexpectedly high number doesn't mean that the majority of ad… [+5157 chars]",
        "url": "https://www.yahoo.com/news/surprisingly-high-number-adults-even-170000907.html"
    },
    {
        "title": "A Potentially Fatal New COVID-Related Syndrome Has Emerged - IFLScience",
        "category": "health",
        "content": "A rare yet deadly autoimmune disorder appears to be on the rise in the north of England, and new research indicates that the outbreak may be linked to COVID-19. Known as Anti-MDA5 positive dermatomyo… [+2658 chars]",
        "url": "https://www.iflscience.com/a-potentially-fatal-new-covid-related-syndrome-has-emerged-74174"
    },
    {
        "title": "Marriage advice: My therapist replaced my husband. Is that so bad? - Slate",
        "category": "health",
        "content": "Slate Plus members get more Care and Feeding every week. Have a question about kids, parenting, or family life? Submit it here!\r\nDear Care and Feeding,\r\nA few years ago, I realized that my husband is… [+3470 chars]",
        "url": "https://slate.com/advice/2024/05/marriage-therapist-husband-emotional-advice-parenting.html"
    },
    {
        "title": "If You're Feeling Congested, These Foods And Drinks Could Be To Blame - BuzzFeed",
        "category": "health",
        "content": "Anderson-Haynes suggests consuming anti-inflammatory ingredients to help reduce congestion. Capsaicin, an active compound in cayenne and other hot peppers, can cause blood vessels to open up. \r\nSinus… [+1758 chars]",
        "url": "https://www.huffpost.com/entry/foods-for-congestion_l_65e24265e4b005b858346007"
    },
    {
        "title": "Tilapia with walnut crust is ready in minutes in an air fryer - Detroit Free Press",
        "category": "health",
        "content": "Weve reeled in a delicious and healthful recipe for walnut-crusted tilapia that's quick and easy to make. This flaky, white fish is an excellent source of vitamin B12. Following the guidelines from t… [+3563 chars]",
        "url": "https://www.freep.com/story/entertainment/dining/2024/05/11/tilapia-with-walnut-crust-is-ready-in-minutes-in-an-air-fryer/73622324007/"
    },
    {
        "title": "Sexually active older adults are getting syphilis and other STIs - The Washington Post",
        "category": "health",
        "content": "Any falls in the past 90 days? Are you sleeping okay, getting enough exercise, eating well? What medications are you taking? My primary care doctor asked the questions youd expect at the annual physi… [+339 chars]",
        "url": "https://www.washingtonpost.com/wellness/2024/05/11/sex-stds-gonorrhea-syphilis-seniors/"
    },
    {
        "title": "8 benefits of walking more than 10,000 steps a day - The Times of India",
        "category": "health",
        "content": "Walking is an excellent way to burn calories and promote weight loss. By walking more than 10,000 steps a day, you can increase your daily calorie expenditure and create a calorie deficit, which is e… [+356 chars]",
        "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/fitness/8-benefits-of-walking-more-than-10000-steps-a-day/photostory/109948330.cms"
    },
    {
        "title": "A Bethel Park mom is ready for Mother's Day following a life-threatening infection - Pittsburgh Post-Gazette",
        "category": "health",
        "content": "MENU",
        "url": "https://www.post-gazette.com/life/holidays/2024/05/11/myocarditis-heart-attack-virus-lvad-allegheny-general-hospital/stories/202405120032"
    },
    {
        "title": "Mammogram guideline sparks debate among breast cancer experts - Newsday",
        "category": "health",
        "content": "Health experts agree that mammograms can save lives, but they dont always agree on how often women should get the breast cancer screening procedure or when they should start.\r\nThe U.S. Preventive Ser… [+11405 chars]",
        "url": "https://www.newsday.com/news/health/mammogram-guidelines-fd06l87h"
    },
    {
        "title": "Bodybuilder ditched low carb diet, started eating potatoes, got ripped - Business Insider",
        "category": "health",
        "content": "As a competitive bodybuilder, Mark Taylor spent decades training hard and eating a strict low-carb diet, only to miss out on the top prizes in his native Scotland.\r\nThat was until he made a drastic c… [+5689 chars]",
        "url": "https://www.businessinsider.com/bodybuilder-got-ripped-built-muscle-eating-potato-carbs-mark-taylor-2024-4"
    },
    {
        "title": "A deadly coronavirus has resurfaced in Saudi Arabia, killing at least one patient - Salon",
        "category": "health",
        "content": null,
        "url": "https://www.salon.com/2024/05/11/a-has-resurfaced-in-saudi-arabia-at-least-one-patient/"
    },
    {
        "title": "How trash, sprawl and a warming world impact Michigan mosquito seasons - Detroit News",
        "category": "health",
        "content": "Skip to main content\r\nThis content is only available to subscribers.\r\nGet unlimited digital access.\r\nYour subscription supports:\r\nTrusted, up-to-date local Detroit and Michigan-wide breaking news.\r\nA… [+1498 chars]",
        "url": "https://www.detroitnews.com/story/news/local/michigan/2024/05/10/trash-sprawl-climate-change-michigan-mosquito-disease-february/73458189007/"
    },
    {
        "title": "The stormy sun erupts with its biggest solar flare yet from a massive sunspot — and it's still crackling (video) - Space.com",
        "category": "science",
        "content": "Just when we thought we'd seen the most powerful flares from a colossal sunspot, the sun unleashed its strongest eruption of the weekend yet, triggering a radio blackout even as the star continues to… [+2798 chars]",
        "url": "https://www.space.com/sun-fires-off-massive-x-class-solar-flares-may-11-2024"
    },
    {
        "title": "Nasa team led by Indian-origin scientist unravels what is behind superheating of Sun's mossy region - The Times of India",
        "category": "science",
        "content": null,
        "url": "https://timesofindia.indiatimes.com/home/science/nasa-team-led-by-indian-origin-scientist-unravels-what-is-behind-superheating-of-suns-mossy-region/articleshow/110041055.cms"
    },
    {
        "title": "Tuna Crabs, Neither Tuna Nor Crabs, Are Swarming Near San Diego - Yahoo! Voices",
        "category": "science",
        "content": "Block Page Bypass requires that your browser have cookies enabled. Please enable cookies in your privacy preferences before continuing.\r\nBlock Page Bypass is a feature that allows authorized users to… [+214 chars]",
        "url": "https://www.yahoo.com/news/tuna-crabs-neither-tuna-nor-140755588.html"
    },
    {
        "title": "[Removed]",
        "category": "science",
        "content": "[Removed]",
        "url": "https://removed.com"
    },
    {
        "title": "Best things I did in Iceland instead of seeing Northern Lights - Business Insider",
        "category": "science",
        "content": null,
        "url": "https://www.businessinsider.com/best-things-to-do-in-iceland-instead-of-northern-lights-2024-5"
    },
    {
        "title": "NASA Inspector Alarmed by Extensive Damage to Heatshield of Astronaut Moon Vehicle - Futurism",
        "category": "science",
        "content": "In November 2022, NASA launched its first uncrewed Moon-orbiting mission, Artemis I kicking off the agency's greater ambitions to return humans to the lunar surface.\r\nThe journey, which saw an Orion … [+3145 chars]",
        "url": "https://futurism.com/nasa-inspector-alarmed-damage-heatshield-moon"
    },
    {
        "title": "Is dark matter's main rival theory dead? - Ars Technica",
        "category": "science",
        "content": "Enlarge/ Galaxy rotation has long perplexed scientists.\r\n91\r\nOne of the biggest mysteries in astrophysics today is that the forces in galaxies do not seem to add up. Galaxies rotate much faster than … [+2703 chars]",
        "url": "https://theconversation.com/is-dark-matters-main-rival-theory-dead-theres-bad-news-from-the-cassini-spacecraft-and-other-recent-tests-228826"
    },
    {
        "title": "Site Highlights Early Humans' Mastery of Wood, Largely Lost - Newser",
        "category": "science",
        "content": "The Stone Age, launched roughly 3 million years ago, marks the time when tools first appeared. Early humans used stones for hammering, stones for grinding, and sharp stone flakes as knives and projec… [+1948 chars]",
        "url": "https://www.newser.com/story/350000/these-are-humans-oldest-preserved-hunting-weapons.html"
    },
    {
        "title": "How the Moon got a makeover - Ars Technica",
        "category": "science",
        "content": "6\r\nOur Moon may appear to shine peacefully in the night sky, but billions of years ago, it was given a facial by volcanic turmoil.\r\nOne question that has gone unanswered for decades is why there are … [+4841 chars]",
        "url": "https://arstechnica.com/science/2024/05/how-the-moon-got-a-makeover/"
    },
    {
        "title": "NASA's Chandra spacecraft spots supermassive black hole erupting in the Milky Way's heart - Space.com",
        "category": "science",
        "content": "Using NASA's Chandra X-ray space telescope, scientists have discovered a new cosmic \"exhaust vent\" funneling hot gas away from Sagittarius A* (Sgr A*), the supermassive black hole that sits at the ve… [+4463 chars]",
        "url": "https://www.space.com/the-universe/black-holes/nasas-chandra-spacecraft-spots-supermassive-black-hole-erupting-in-the-milky-ways-heart"
    },
    {
        "title": "New Epigenome Editing Platform Enables the Precise Programming of Epigenetic Modifications - SciTechDaily",
        "category": "science",
        "content": "Researchers developed a new epigenome editing platform that allows precise manipulation of chromatin marks, revealing their direct impact on gene expression and challenging previous understanding of … [+5111 chars]",
        "url": "https://scitechdaily.com/new-epigenome-editing-platform-enables-the-precise-programming-of-epigenetic-modifications/"
    },
    {
        "title": "NASA wants a cheaper Mars Sample Return—Boeing proposes most expensive rocket - Ars Technica",
        "category": "science",
        "content": "Enlarge/ The Space Launch System rocket lifts off on the Artemis I mission.\r\n33\r\nNASA is looking for ways to get rock samples back from Mars for less than the $11 billion the agency would need under … [+3998 chars]",
        "url": "https://arstechnica.com/space/2024/05/nasa-wants-a-cheaper-mars-sample-return-boeing-proposes-most-expensive-rocket/"
    },
    {
        "title": "A New Target Launch Date for Our Boeing Crew Flight Test on This Week @NASA – May 10 - NASA",
        "category": "science",
        "content": null,
        "url": "https://www.youtube.com/watch?v=53OK0s2uenY"
    },
    {
        "title": "Mysterious Objects in Space Could Be Giant Dyson Spheres, Scientists Say - ScienceAlert",
        "category": "science",
        "content": "There's something poetic about humanity's attempt to detect other civilizations somewhere in the Milky Way's expanse. There's also something futile about it. But we're not going to stop. There's litt… [+6183 chars]",
        "url": "https://www.sciencealert.com/mysterious-objects-in-space-could-be-giant-dyson-spheres-scientists-say"
    },
    {
        "title": "Serbia becomes latest country to join China's ILRS moon base project - SpaceNews",
        "category": "science",
        "content": "HELSINKI Serbia has signed an agreement on participating in the China-led International Lunar Research Station.\r\nSerbia’s Ministry of Science, Technological Development and Innovation signed a memora… [+6007 chars]",
        "url": "https://spacenews.com/serbia-becomes-latest-country-to-join-chinas-ilrs-moon-base-project/"
    },
    {
        "title": "News from the Press Site: New SpaceX spacesuits and China's Chang'e 6 reaches orbit around the Moon – Spaceflight Now - Spaceflight Now",
        "category": "science",
        "content": "In this week’s edition of News from the Press Site, Spaceflight Now’s Will Robinson-Smith is joined by Jeff Foust, senior writer at Space News, and Bill Harwood, space consultant for CBS News.\r\nThe p… [+359 chars]",
        "url": "https://spaceflightnow.com/2024/05/10/news-from-the-press-site-new-spacex-spacesuits-and-chinas-change-6-reaches-orbit-around-the-moon/"
    },
    {
        "title": "Planet 9 Updates // Vera Rubin Mirror // New SpaceX EVA Suit - Fraser Cain",
        "category": "science",
        "content": null,
        "url": "https://www.youtube.com/watch?v=_OIfxkBc4-8"
    },
    {
        "title": "A once-in-a-lifetime celestial explosion may be near — and Canadians can see it - Global News",
        "category": "science",
        "content": null,
        "url": "https://www.youtube.com/watch?v=X6LBK72jI1c"
    },
    {
        "title": "Brain Veins as Light Detectors: A New Path to Deep Brain Imaging - Neuroscience News",
        "category": "science",
        "content": "Summary: Researchers innovated a novel bioluminescence detection technique to image deep brain structures, circumventing the challenge of light scattering. This method involves engineering brain bloo… [+8410 chars]",
        "url": "https://neurosciencenews.com/brain-light-neuroimaging-26083/"
    },
    {
        "title": "Cracking! Some binary black holes may roll around each other in egg-shaped orbits - Space.com",
        "category": "science",
        "content": "Black hole week reaches its conclusion today (May 10), and there's no better way to mark the occasion than with some \"eggs-traordinary\" black hole science.\r\nUsing gravitational wave measurements by t… [+8673 chars]",
        "url": "https://www.space.com/binary-black-holes-egg-shaped-orbits-gravitational-waves"
    },
    {
        "title": "Ex-Patriots coach Bill Belichick lands new gig with 'ManningCast' - Fox News",
        "category": "sports",
        "content": "It looks like former New England Patriots\r\n head coach Bill Belichick has a new gig. \r\nPeyton Manning confirmed Friday during an appearance on \"The Pat McAfee Show\" that Belichick will be featured as… [+1811 chars]",
        "url": "https://www.foxnews.com/sports/ex-patriots-coach-bill-belichick-lands-new-gig-manningcast"
    },
    {
        "title": "Oklahoma City Thunder @ Dallas Mavericks | #NBAPlayoffs presented by Google Pixel Live Scoreboard - NBA",
        "category": "sports",
        "content": null,
        "url": "https://www.youtube.com/watch?v=R3h-YVB7KQ4"
    },
    {
        "title": "Commanders' Johnny Newton to have surgery on left foot - ESPN",
        "category": "sports",
        "content": "ASHBURN, Va. -- Washington Commanders second-round pick Johnny Newton will undergo surgery within a week to repair an injury to his left foot -- about four months after the defensive tackle had a pro… [+1766 chars]",
        "url": "https://www.espn.com/nfl/story/_/id/40126471/commanders-johnny-newton-surgery-left-foot"
    },
    {
        "title": "Paul Skenes debut best moments and highlights - MLB.com",
        "category": "sports",
        "content": null,
        "url": "https://www.mlb.com/news/paul-skenes-debut-best-moments-and-highlights"
    },
    {
        "title": "Suns hire ex-Bucks head coach Mike Budenholzer to replace Frank Vogel - Yahoo Sports",
        "category": "sports",
        "content": "If you click 'Accept all', we and our partners, including 238 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+678 chars]",
        "url": "https://sports.yahoo.com/suns-hire-ex-bucks-head-coach-mike-budenholzer-to-replace-frank-vogel-142714158.html"
    },
    {
        "title": "Mystik Dan to race in upcoming Preakness Stakes - The Athletic",
        "category": "sports",
        "content": "Kentucky Derby winner Mystik Dan will go for the second leg of the Triple Crown and run in the Preakness Stakes on May 18.\r\nKenny McPeek, the horses trainer, previously said he wanted to ensure the h… [+1823 chars]",
        "url": "https://theathletic.com/5486240/2024/05/11/mystik-dan-preakness-stakes/"
    },
    {
        "title": "Eliot Wolf Named Executive Vice President of Player Personnel - Patriots.com",
        "category": "sports",
        "content": null,
        "url": "https://www.patriots.com/news/eliot-wolf-named-executive-vice-president-of-player-personnel"
    },
    {
        "title": "Brad Marchand questionable for G4; Bruins unhappy with hit - ESPN",
        "category": "sports",
        "content": "BOSTON -- Brad Marchand is day-to-day with an upper-body injury after a collision with Florida Panthers forward Sam Bennett in Game 3 that the Boston Bruins said might have crossed the line.\r\nThe Bru… [+3034 chars]",
        "url": "https://www.espn.com/nhl/story/_/id/40126082/brad-marchand-questionable-g4-bruins-unhappy-hit"
    },
    {
        "title": "Rangers' Filip Chytil a game-time decision for Game 4 with 'illness' - New York Post ",
        "category": "sports",
        "content": "RALEIGH, N.C. After competing in his first game back from a suspected concussion that sidelined him for the past six months, Filip Chytil was not on the ice for the Rangers morning skate on Saturday … [+2284 chars]",
        "url": "https://nypost.com/2024/05/11/sports/rangers-filip-chytil-a-game-time-decision-for-game-4/"
    },
    {
        "title": "Patriots rookie minicamp notebook: Drake Maye focuses on new fundamentals - Pats Pulpit",
        "category": "sports",
        "content": "The New England Patriots rookie class which includes eight draftees along with UDFAs plus tryout players returned to the back fields of Gillette Stadium for Day 2 of rookie minicamp on Saturday.\r\nWhi… [+2382 chars]",
        "url": "https://www.patspulpit.com/2024/5/11/24154332/patriots-rookie-minicamp-notebook-drake-maye-fundamentals"
    },
    {
        "title": "Iowa wrestling icon Spencer Lee qualifies for 2024 Paris Olympics - Hawk Central",
        "category": "sports",
        "content": null,
        "url": "https://www.hawkcentral.com/story/sports/college/iowa/wrestling/2024/05/11/iowa-wrestling-spencer-lee-qualifies-for-2024-paris-olympics-hawkeyes/73604523007/"
    },
    {
        "title": "Bills invite pro lacrosse player Zed Williams to rookie minicamp - NBC Sports",
        "category": "sports",
        "content": "NFL scouts need to be willing to look for talent anywhere they can find it.\r\nThe Bills are looking to another sport.\r\nZed Williams, a professional lacrosse player, is trying out at the teams rookie m… [+462 chars]",
        "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/bills-invite-pro-lacrosse-player-zed-williams-to-rookie-minicamp"
    },
    {
        "title": "Should Blackhawks draft Ivan Demidov or Artyom Levshunov? Experts weigh in - The Athletic",
        "category": "sports",
        "content": "The Chicago Blackhawks will discuss a lot of players they could pick at No. 2 in next months NHL Draft. They have to talk through all the big prospects.\r\nBut, as weve already written, it likely comes… [+8143 chars]",
        "url": "https://theathletic.com/5482463/2024/05/11/blackhawks-draft-pick-demidov-levshunov/"
    },
    {
        "title": "After latest victory, Giro d'Italia leader Tadej Pogačar defends strategy of winning as many stages as possible - Cyclingnews",
        "category": "sports",
        "content": "Giro d’Italia leader Tadej Pogačar (UAE Team Emirates) blasted to his second stage win in 24 hours and third of this year’s race so far on Saturday, then brushed aside rival riders’ annoyance that he… [+5306 chars]",
        "url": "https://www.cyclingnews.com/news/after-latest-victory-giro-ditalia-leader-tadej-pogacar-defends-strategy-of-winning-as-many-stages-as-possible/"
    },
    {
        "title": "John Elway Breaks Silence on Broncos Drafting Bo Nix - Sports Illustrated",
        "category": "sports",
        "content": "The Denver Broncos are currently convened at Centura Health Training Center for rookie minicamp. Hot on the heels of taking Oregon quarterback Bo Nix in the first round, the Broncos made short work o… [+2254 chars]",
        "url": "https://www.si.com/nfl/broncos/news/john-elway-comments-bo-nix-broncos-draft"
    },
    {
        "title": "Grading The Week: Shaquille O’Neal’s Nikola Jokic rant made NBA, TNT, Warner Bros. Discovery look like absolute fools - The Denver Post",
        "category": "sports",
        "content": "Ke Huy Quan opens the envelope at the Academy Award for Best Actor in a Supporting Role. “And the Oscar goes to … Robert Downey Jr.!”\r\nOnly he’s … not … done.\r\n“Wait, wait, wait,” Quan continues. “I’… [+3459 chars]",
        "url": "https://www.denverpost.com/2024/05/11/shaquille-oneal-nikola-jokic-rant-nba-tnt-fools/"
    },
    {
        "title": "How To Watch the 2024 NBA Draft Lottery: Television, Streaming, and Start Time - Blazer's Edge",
        "category": "sports",
        "content": "On Sunday, the NBA will conduct their annual Draft Lottery. The actual lottery takes place behind closed doors, and the picks are revealed live on TV. This year, the NBA will change the time and date… [+1132 chars]",
        "url": "https://www.blazersedge.com/2024/5/11/24153720/nba-draft-lottery-television-streaming-time-date-abc-espn"
    },
    {
        "title": "Mbappe will leave PSG – what does this mean for him, the club and Real Madrid? - The Athletic",
        "category": "sports",
        "content": "Kylian Mbappe confirmed the open secret on Friday night. He will leave Paris Saint-Germain at the end of the season with Sundays game against Toulouse to be his final match for the club at the Parc d… [+9285 chars]",
        "url": "https://theathletic.com/5485048/2024/05/11/kylian-mbappe-psg-real-madrid-transfer/"
    },
    {
        "title": "Tottenham player ratings vs Burnley as Van de Ven scores winner with Romero and Maddison on form - Football.London",
        "category": "sports",
        "content": "Tottenham ended their recent struggles with a 2-1 victory against Burnley in the Premier League on Saturday afternoon.\r\nAnge Postecoglou made two changes to his Tottenham side to face the Clarets, kn… [+4974 chars]",
        "url": "https://www.football.london/tottenham-hotspur-fc/news/tottenham-player-ratings-vs-burnley-29152055"
    },
    {
        "title": "Steelers add two players to rookie minicamp roster - Behind The Steel Curtain",
        "category": "sports",
        "content": "The Pittsburgh Steelers have added two names to their rookie minicamp roster. The Steelers are bringing in Michigan tight end Joel Honigford and Bowie State linebacker Joshua Pryor, the team announce… [+765 chars]",
        "url": "https://www.behindthesteelcurtain.com/pittsburgh-steelers-news/2024/5/11/24154287/steelers-add-two-players-to-rookie-minicamp-roster-nfl-2024-payton-wilson"
    },
    {
        "title": "How to take pictures of the Northern Lights with Google Pixel and other Android phones - 9to5Google",
        "category": "technology",
        "content": "The biggest geomagnetic storm in over 20 years is hitting the Earth this weekend, and it’s leading to the Northern Lights being visible in huge portions of the Northern hemisphere. Here’s how to take… [+3202 chars]",
        "url": "http://9to5google.com/2024/05/11/how-to-take-pictures-northern-lights-android-google-pixel/"
    },
    {
        "title": "Google I/O 2024 will be all about AI again - The Verge",
        "category": "technology",
        "content": "Google I/O 2024 will be all about AI again\r\nGoogle I/O 2024 will be all about AI again\r\n / Googles developer conference starts with a 1PM ET keynote on May 14th.\r\nByWes Davis, a weekend editor who co… [+3258 chars]",
        "url": "https://www.theverge.com/2024/5/11/24154219/google-i-o-2024-what-to-expect-where-watch-livestream-ai-android-search-gemini"
    },
    {
        "title": "Steam Users Surprised With Free Download for Classic Game - ComicBook.com",
        "category": "technology",
        "content": null,
        "url": "https://comicbook.com/gaming/news/steam-free-game-download-marathon/"
    },
    {
        "title": "A budget Pixel phone is an oxymoron in 2024 - Android Authority",
        "category": "technology",
        "content": "Google has made its bed and must now lie in it: There is no such thing as a budget Pixel anymore.\r\nLooking at the new Pixel 8a, a few things regarding Googles strategy and priorities became abundantl… [+3159 chars]",
        "url": "https://www.androidauthority.com/budget-pixel-phone-oxymoron-3441521/"
    },
    {
        "title": "Crow Country is a gloriously grimy revival of '90s survival horror - The Verge",
        "category": "technology",
        "content": "Crow Country is a gloriously grimy revival of 90s survival horror\r\nCrow Country is a gloriously grimy revival of 90s survival horror\r\n / If you miss PlayStation-era Resident Evil and Silent Hill, thi… [+3684 chars]",
        "url": "https://www.theverge.com/24153478/crow-country-review-steam-ps5-xbox"
    },
    {
        "title": "Apple and OpenAI to announce updates, as AI arms race intensifies - Salon",
        "category": "technology",
        "content": null,
        "url": "https://www.salon.com/2024/05/11/apple-and-openai-to-announce-updates-as-ai-arms-race-intensifies/"
    },
    {
        "title": "Android in the time of AI - The Verge",
        "category": "technology",
        "content": "Android in the time of AI\r\nAndroid in the time of AI\r\n / Googles mobile platform will have to look a little different to compete in the AI era.\r\nByAllison Johnson, a reviewer with 10 years of experie… [+3254 chars]",
        "url": "https://www.theverge.com/2024/5/11/24152977/android-ai-google-io-2024-gemini"
    },
    {
        "title": "Neuralink: Chip adjustment after malfunction improved cursor movement - USA TODAY",
        "category": "technology",
        "content": "There have been some issues with Neuralinks brain-computer interface device, or brain chip since it was implanted in its first human patient, the company said in a blog post. \r\nIts been about eight m… [+2959 chars]",
        "url": "https://www.usatoday.com/story/tech/news/2024/05/11/neuralink-malfunction-resolved-bps-improved/73647719007/"
    },
    {
        "title": "Ghost of Tsushima Director's Cut PC players are getting auto-refunds if they cannot legally sign up for PSN - Eurogamer.net",
        "category": "technology",
        "content": "Steam is auto-refunding players who bought Ghost of Tsushima Director's Cut in countries where PSN isn't available.\r\nLast week – around the same time Helldivers 2 was being pulled from sale in 177 co… [+2021 chars]",
        "url": "https://www.eurogamer.net/ghost-of-tsushima-directors-cut-pc-players-are-getting-auto-refunds-if-they-cannot-legally-sign-up-for-psn"
    },
    {
        "title": "After calling the next Battlefield \"another tremendous live service,\" EA CEO threatens to put ads in AAA games - Gamesradar",
        "category": "technology",
        "content": "Electronic Arts CEO Andrew Wilson made a string of controversial statements in the company's most recent earnings call, with potential in-game ads and comments about the next Battlefield raising some… [+2458 chars]",
        "url": "https://www.gamesradar.com/games/fps/after-calling-the-next-battlefield-another-tremendous-live-service-ea-ceo-threatens-to-put-ads-in-aaa-games/"
    },
    {
        "title": "Apple iPhone 16 Pro: Design Upgrade Shines In New Leak - Forbes",
        "category": "technology",
        "content": "The next iPhones wont arrive until this fall, but a new report has revealed that a new, much brighter display could be in the offing for the iPhone 16 Pro and iPhone 16 Pro Max, 20% brighter than the… [+2307 chars]",
        "url": "https://www.forbes.com/sites/davidphelan/2024/05/11/apple-iphone-16-pro-new-leak-reveals-radically-upgraded-design/"
    },
    {
        "title": "Helldivers 2 gets delisted in more countries without PSN access, blindsided devs call for it to be \"available worldwide\" - Gamesradar",
        "category": "technology",
        "content": "Helldivers 2 is still being removed from sale on Steam in more countries, even after publisher Sony Interactive Entertainment (SIE) scrapped its hugely controversial PSN mandate. \r\nSIE previously att… [+1828 chars]",
        "url": "https://www.gamesradar.com/games/third-person-shooter/helldivers-2-gets-delisted-in-more-countries-without-psn-access-blindsided-devs-call-for-it-to-be-available-worldwide/"
    },
    {
        "title": "This $349 iPad was sneakily the best announcement during Apple's 'Let Loose' event - ZDNet",
        "category": "technology",
        "content": "Kerry Wan/ZDNET\r\nDuring Apple's \"Let Loose\" event, the company announced several iPad upgrades, including a larger iPad Air, Apple Silicon advances, its thinnest consumer device yet, and more. Apple … [+1737 chars]",
        "url": "https://www.zdnet.com/article/this-349-ipad-was-sneakily-the-best-announcement-during-apples-let-loose-event/"
    },
    {
        "title": "Rare Michael Jordan card could fetch $5M at auction: Ken Goldin reveals '100 best collectibles' - Fox Business",
        "category": "technology",
        "content": "Goldin Auction’s second annual Goldin 100 event displays the rarest and most valuable collectibles of the year.\r\nThe 2024 roundup does not disappoint, with a variety of pop culture items and sports m… [+3879 chars]",
        "url": "https://www.foxbusiness.com/lifestyle/rare-michael-jordan-card-could-fetch-5m-auction-ken-goldin-reveals-100-best-collectibles"
    },
    {
        "title": "iPad Pro with M4 chip boasts impressive performance jump compared to just-released M3 MacBook Air - 9to5Mac",
        "category": "technology",
        "content": "The M4 is looking like a very strong generation for Apple Silicon. According to leaked Geekbench scores likely posted by reviewers who already got their hands on the new iPad ahead of next week’s emb… [+3272 chars]",
        "url": "https://9to5mac.com/2024/05/11/ipad-pro-with-m4-chip-geekbench-compared-m3/"
    },
    {
        "title": "Amazon seller rips Popflex founder Cassey Ho's video, changes her face in dupe listing: Very 'Black Mirror' - Fox Business",
        "category": "technology",
        "content": "Imagine seeing a video of yourself in your own home featured on an Amazon listing — and it's altered so that your face looks like someone else's.\r\nThat's what happened to Cassey Ho, founder and CEO o… [+6934 chars]",
        "url": "https://www.foxbusiness.com/technology/amazon-seller-ripped-popflex-founder-cassey-hos-video-changed-her-face-dupe-listing-very-black-mirror"
    },
    {
        "title": "The 50 Best Spring Deals to Snag at Amazon From $6 - InStyle",
        "category": "technology",
        "content": "Its always a good idea to treat yourself on the weekend, and a holiday weekend is all the more reason to splurge. As you celebrate the maternal figure in your life this Mothers Day, be sure to make t… [+8057 chars]",
        "url": "https://www.instyle.com/best-mothers-day-weekend-deals-amazon-2024-8646860"
    },
    {
        "title": "iPad Pro 2024 vs Microsoft Surface Pro 10: How these premium tablets compare - Tom's Guide",
        "category": "technology",
        "content": "There's a lot to consider when trying to decide between buying the new iPad Pro 2024 vs Microsoft Surface Pro 10, the latest flagship tablets from Apple and Microsoft.\r\nWith its fancy new OLED displa… [+15027 chars]",
        "url": "https://www.tomsguide.com/tablets/ipads/ipad-pro-2024-vs-microsoft-surface-pro-10-how-these-premium-tablets-compare"
    },
    {
        "title": "ASUS Scammed Us - Gamers Nexus",
        "category": "technology",
        "content": null,
        "url": "https://www.youtube.com/watch?v=7pMrssIrKcY"
    },
    {
        "title": "40 Treats For Any Poor Unfortunate Soul Who Has Really Had A Terrible Week - BuzzFeed",
        "category": "technology",
        "content": "BuzzFeed writer Emma Lord is a BIG fan of this mascara. She said:\r\n\"Hello, that is my face above, because I bought into the hype of the positive reviews and now I will never look back!! Putting it on… [+727 chars]",
        "url": "https://www.buzzfeed.com/hbraga/treats-for-any-poor-unfortunate-soul-who-has-really-had-a"
    }
]